yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151k3.h
#define RI_IOIR4_CH29I           RI_IOIR4_bit.CH29I
#define RI_IOIR4_CH26I           RI_IOIR4_bit.CH26I
#define RI_IOIR4_CH27I           RI_IOIR4_bit.CH27I
#define RI_IOIR4_CH28I           RI_IOIR4_bit.CH28I

#define RI_IOCMR4_CH29M          RI_IOCMR4_bit.CH29M
#define RI_IOCMR4_CH26M          RI_IOCMR4_bit.CH26M
#define RI_IOCMR4_CH27M          RI_IOCMR4_bit.CH27M
#define RI_IOCMR4_CH28M          RI_IOCMR4_bit.CH28M

#define RI_IOSR4_CH29E           RI_IOSR4_bit.CH29E
#define RI_IOSR4_CH26E           RI_IOSR4_bit.CH26E
#define RI_IOSR4_CH27E           RI_IOSR4_bit.CH27E
#define RI_IOSR4_CH28E           RI_IOSR4_bit.CH28E

#endif

/*-------------------------------------------------------------------------
 *      RI bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RI_ICR1_IC2CS       0x1F

#define MASK_RI_ICR2_IC3CS       0x1F

#define MASK_RI_IOIR1_CH1I       0x01
#define MASK_RI_IOIR1_CH4I       0x02
#define MASK_RI_IOIR1_CH7I       0x04
#define MASK_RI_IOIR1_CH10I      0x08
#define MASK_RI_IOIR1_CH13I      0x10
#define MASK_RI_IOIR1_CH16I      0x20
#define MASK_RI_IOIR1_CH19I      0x40
#define MASK_RI_IOIR1_CH22I      0x80

#define MASK_RI_IOIR2_CH2I       0x01
#define MASK_RI_IOIR2_CH5I       0x02
#define MASK_RI_IOIR2_CH8I       0x04
#define MASK_RI_IOIR2_CH11I      0x08
#define MASK_RI_IOIR2_CH14I      0x10
#define MASK_RI_IOIR2_CH17I      0x20
#define MASK_RI_IOIR2_CH20I      0x40
#define MASK_RI_IOIR2_CH23I      0x80

#define MASK_RI_IOIR3_CH3I       0x01
#define MASK_RI_IOIR3_CH6I       0x02
#define MASK_RI_IOIR3_CH9I       0x04
#define MASK_RI_IOIR3_CH12I      0x08
#define MASK_RI_IOIR3_CH15I      0x10
#define MASK_RI_IOIR3_CH18I      0x20
#define MASK_RI_IOIR3_CH21I      0x40
#define MASK_RI_IOIR3_CH24I      0x80

#define MASK_RI_IOCMR1_CH1M      0x01
#define MASK_RI_IOCMR1_CH4M      0x02
#define MASK_RI_IOCMR1_CH7M      0x04
#define MASK_RI_IOCMR1_CH10M     0x08
#define MASK_RI_IOCMR1_CH13M     0x10
#define MASK_RI_IOCMR1_CH16M     0x20
#define MASK_RI_IOCMR1_CH19M     0x40
#define MASK_RI_IOCMR1_CH22M     0x80

#define MASK_RI_IOCMR2_CH2M      0x01
#define MASK_RI_IOCMR2_CH5M      0x02
#define MASK_RI_IOCMR2_CH8M      0x04
#define MASK_RI_IOCMR2_CH11M     0x08
#define MASK_RI_IOCMR2_CH14M     0x10
#define MASK_RI_IOCMR2_CH17M     0x20
#define MASK_RI_IOCMR2_CH20M     0x40
#define MASK_RI_IOCMR2_CH23M     0x80

#define MASK_RI_IOCMR3_CH3M      0x01
#define MASK_RI_IOCMR3_CH6M      0x02
#define MASK_RI_IOCMR3_CH9M      0x04
#define MASK_RI_IOCMR3_CH12M     0x08
#define MASK_RI_IOCMR3_CH53M     0x10
#define MASK_RI_IOCMR3_CH18M     0x20
#define MASK_RI_IOCMR3_CH21M     0x40
#define MASK_RI_IOCMR3_CH24M     0x80

#define MASK_RI_IOSR1_CH1E       0x01
#define MASK_RI_IOSR1_CH4E       0x02
#define MASK_RI_IOSR1_CH7E       0x04
#define MASK_RI_IOSR1_CH10E      0x08
#define MASK_RI_IOSR1_CH13E      0x10
#define MASK_RI_IOSR1_CH16E      0x20
#define MASK_RI_IOSR1_CH19E      0x40
#define MASK_RI_IOSR1_CH22E      0x80

#define MASK_RI_IOSR2_CH2E       0x01
#define MASK_RI_IOSR2_CH5E       0x02
#define MASK_RI_IOSR2_CH8E       0x04
#define MASK_RI_IOSR2_CH11E      0x08
#define MASK_RI_IOSR2_CH14E      0x10
#define MASK_RI_IOSR2_CH17E      0x20
#define MASK_RI_IOSR2_CH20E      0x40
#define MASK_RI_IOSR2_CH23E      0x80

#define MASK_RI_IOSR3_CH3E       0x01
#define MASK_RI_IOSR3_CH6E       0x02
#define MASK_RI_IOSR3_CH9E       0x04
#define MASK_RI_IOSR3_CH12E      0x08
#define MASK_RI_IOSR3_CH15E      0x10
#define MASK_RI_IOSR3_CH18E      0x20
#define MASK_RI_IOSR3_CH21E      0x40
#define MASK_RI_IOSR3_CH24E      0x80

#define MASK_RI_IOGCR_IOM1       0x03
#define MASK_RI_IOGCR_IOM2       0x0C
#define MASK_RI_IOGCR_IOM3       0x30

#define MASK_RI_ASCR1_AS0        0x01
#define MASK_RI_ASCR1_AS1        0x02
#define MASK_RI_ASCR1_AS2        0x04
#define MASK_RI_ASCR1_AS3        0x08
#define MASK_RI_ASCR1_AS4        0x10
#define MASK_RI_ASCR1_AS5        0x20
#define MASK_RI_ASCR1_AS6        0x40
#define MASK_RI_ASCR1_AS7        0x80

#define MASK_RI_ASCR2_AS8        0x01
#define MASK_RI_ASCR2_AS14       0x40

#define MASK_RI_RCR_KPU10        0x01
#define MASK_RI_RCR_KPU400       0x02
#define MASK_RI_RCR_KPD10        0x04
#define MASK_RI_RCR_KPD400       0x08

#define MASK_RI_CR_TIE           0x01
#define MASK_RI_CR_TIF           0x02
#define MASK_RI_CR_AM            0x04
#define MASK_RI_CR_THALT         0x08

#define MASK_RI_MASKR1_CH1M      0x01
#define MASK_RI_MASKR1_CH4M      0x02
#define MASK_RI_MASKR1_CH7M      0x04
#define MASK_RI_MASKR1_CH10M     0x08
#define MASK_RI_MASKR1_CH13M     0x10
#define MASK_RI_MASKR1_CH16M     0x20
#define MASK_RI_MASKR1_CH19M     0x40
#define MASK_RI_MASKR1_CH22M     0x80

#define MASK_RI_MASKR2_CH2M      0x01
#define MASK_RI_MASKR2_CH5M      0x02
#define MASK_RI_MASKR2_CH8M      0x04
#define MASK_RI_MASKR2_CH11M     0x08
#define MASK_RI_MASKR2_CH14M     0x10
#define MASK_RI_MASKR2_CH17M     0x20
#define MASK_RI_MASKR2_CH20M     0x40
#define MASK_RI_MASKR2_CH23M     0x80

#define MASK_RI_MASKR3_CH3M      0x01
#define MASK_RI_MASKR3_CH6M      0x02
#define MASK_RI_MASKR3_CH9M      0x04
#define MASK_RI_MASKR3_CH12M     0x08
#define MASK_RI_MASKR3_CH15M     0x10
#define MASK_RI_MASKR3_CH18M     0x20
#define MASK_RI_MASKR3_CH21M     0x40
#define MASK_RI_MASKR3_CH24M     0x80

#define MASK_RI_MASKR4_CH29M     0x01
#define MASK_RI_MASKR4_CH26M     0x02
#define MASK_RI_MASKR4_CH27M     0x40
#define MASK_RI_MASKR4_CH28M     0x80

#define MASK_RI_IOIR4_CH29I      0x01
#define MASK_RI_IOIR4_CH26I      0x02
#define MASK_RI_IOIR4_CH27I      0x40
#define MASK_RI_IOIR4_CH28I      0x80

#define MASK_RI_IOCMR4_CH29M     0x01
#define MASK_RI_IOCMR4_CH26M     0x02
#define MASK_RI_IOCMR4_CH27M     0x40
#define MASK_RI_IOCMR4_CH28M     0x80

#define MASK_RI_IOSR4_CH29E      0x01
#define MASK_RI_IOSR4_CH26E      0x02
#define MASK_RI_IOSR4_CH27E      0x40
#define MASK_RI_IOSR4_CH28E      0x80


/*-------------------------------------------------------------------------
 *      COMP register definitions
 *-----------------------------------------------------------------------*/
/* Comparator control and status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CMP1        : 2;
  unsigned char STE         : 1;
  unsigned char CMP1OUT     : 1;
  unsigned char EF1         : 1;
  unsigned char IE1         : 1;
} __BITS_COMP_CSR1;
#endif
__IO_REG8_BIT(COMP_CSR1,   0x5440, __READ_WRITE, __BITS_COMP_CSR1);

/* Comparator control and status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CMP2        : 2;
  unsigned char SPEED       : 1;
  unsigned char CMP2OUT     : 1;
  unsigned char EF2         : 1;
  unsigned char IE2         : 1;
} __BITS_COMP_CSR2;
#endif
__IO_REG8_BIT(COMP_CSR2,   0x5441, __READ_WRITE, __BITS_COMP_CSR2);

