yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151k3.h
/* Interrupt Software priority register 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT20SPR   : 2;
  unsigned char VECT21SPR   : 2;
  unsigned char VECT22SPR   : 2;
  unsigned char VECT23SPR   : 2;
} __BITS_ITC_SPR6;
#endif
__IO_REG8_BIT(ITC_SPR6,    0x7F75, __READ_WRITE, __BITS_ITC_SPR6);

/* Interrupt Software priority register 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT24SPR   : 2;
  unsigned char VECT25SPR   : 2;
  unsigned char VECT26SPR   : 2;
  unsigned char VECT27SPR   : 2;
} __BITS_ITC_SPR7;
#endif
__IO_REG8_BIT(ITC_SPR7,    0x7F76, __READ_WRITE, __BITS_ITC_SPR7);

/* Interrupt Software priority register 8 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VECT28SPR   : 2;
  unsigned char VECT29SPR   : 2;
} __BITS_ITC_SPR8;
#endif
__IO_REG8_BIT(ITC_SPR8,    0x7F77, __READ_WRITE, __BITS_ITC_SPR8);


/*-------------------------------------------------------------------------
 *      ITC-SPR bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ITC_SPR1_VECT0SPR        ITC_SPR1_bit.VECT0SPR
#define ITC_SPR1_VECT1SPR        ITC_SPR1_bit.VECT1SPR
#define ITC_SPR1_VECT2SPR        ITC_SPR1_bit.VECT2SPR
#define ITC_SPR1_VECT3SPR        ITC_SPR1_bit.VECT3SPR

#define ITC_SPR2_VECT4SPR        ITC_SPR2_bit.VECT4SPR
#define ITC_SPR2_VECT5SPR        ITC_SPR2_bit.VECT5SPR
#define ITC_SPR2_VECT6SPR        ITC_SPR2_bit.VECT6SPR
#define ITC_SPR2_VECT7SPR        ITC_SPR2_bit.VECT7SPR

#define ITC_SPR3_VECT8SPR        ITC_SPR3_bit.VECT8SPR
#define ITC_SPR3_VECT9SPR        ITC_SPR3_bit.VECT9SPR
#define ITC_SPR3_VECT10SPR       ITC_SPR3_bit.VECT10SPR
#define ITC_SPR3_VECT11SPR       ITC_SPR3_bit.VECT11SPR

#define ITC_SPR4_VECT12SPR       ITC_SPR4_bit.VECT12SPR
#define ITC_SPR4_VECT13SPR       ITC_SPR4_bit.VECT13SPR
#define ITC_SPR4_VECT14SPR       ITC_SPR4_bit.VECT14SPR
#define ITC_SPR4_VECT15SPR       ITC_SPR4_bit.VECT15SPR

#define ITC_SPR5_VECT16SPR       ITC_SPR5_bit.VECT16SPR
#define ITC_SPR5_VECT17SPR       ITC_SPR5_bit.VECT17SPR
#define ITC_SPR5_VECT18SPR       ITC_SPR5_bit.VECT18SPR
#define ITC_SPR5_VECT19SPR       ITC_SPR5_bit.VECT19SPR

#define ITC_SPR6_VECT20SPR       ITC_SPR6_bit.VECT20SPR
#define ITC_SPR6_VECT21SPR       ITC_SPR6_bit.VECT21SPR
#define ITC_SPR6_VECT22SPR       ITC_SPR6_bit.VECT22SPR
#define ITC_SPR6_VECT23SPR       ITC_SPR6_bit.VECT23SPR

#define ITC_SPR7_VECT24SPR       ITC_SPR7_bit.VECT24SPR
#define ITC_SPR7_VECT25SPR       ITC_SPR7_bit.VECT25SPR
#define ITC_SPR7_VECT26SPR       ITC_SPR7_bit.VECT26SPR
#define ITC_SPR7_VECT27SPR       ITC_SPR7_bit.VECT27SPR

#define ITC_SPR8_VECT28SPR       ITC_SPR8_bit.VECT28SPR
#define ITC_SPR8_VECT29SPR       ITC_SPR8_bit.VECT29SPR

#endif

/*-------------------------------------------------------------------------
 *      ITC-SPR bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ITC_SPR1_VECT0SPR   0x03
#define MASK_ITC_SPR1_VECT1SPR   0x0C
#define MASK_ITC_SPR1_VECT2SPR   0x30
#define MASK_ITC_SPR1_VECT3SPR   0xC0

#define MASK_ITC_SPR2_VECT4SPR   0x03
#define MASK_ITC_SPR2_VECT5SPR   0x0C
#define MASK_ITC_SPR2_VECT6SPR   0x30
#define MASK_ITC_SPR2_VECT7SPR   0xC0

#define MASK_ITC_SPR3_VECT8SPR   0x03
#define MASK_ITC_SPR3_VECT9SPR   0x0C
#define MASK_ITC_SPR3_VECT10SPR  0x30
#define MASK_ITC_SPR3_VECT11SPR  0xC0

#define MASK_ITC_SPR4_VECT12SPR  0x03
#define MASK_ITC_SPR4_VECT13SPR  0x0C
#define MASK_ITC_SPR4_VECT14SPR  0x30
#define MASK_ITC_SPR4_VECT15SPR  0xC0

#define MASK_ITC_SPR5_VECT16SPR  0x03
#define MASK_ITC_SPR5_VECT17SPR  0x0C
#define MASK_ITC_SPR5_VECT18SPR  0x30
#define MASK_ITC_SPR5_VECT19SPR  0xC0

#define MASK_ITC_SPR6_VECT20SPR  0x03
#define MASK_ITC_SPR6_VECT21SPR  0x0C
#define MASK_ITC_SPR6_VECT22SPR  0x30
#define MASK_ITC_SPR6_VECT23SPR  0xC0

#define MASK_ITC_SPR7_VECT24SPR  0x03
#define MASK_ITC_SPR7_VECT25SPR  0x0C
#define MASK_ITC_SPR7_VECT26SPR  0x30
#define MASK_ITC_SPR7_VECT27SPR  0xC0

#define MASK_ITC_SPR8_VECT28SPR  0x03
#define MASK_ITC_SPR8_VECT29SPR  0x0C


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* DM breakpoint 1 register extended byte */
__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
/* DM breakpoint 1 register high byte */
__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
/* DM breakpoint 1 register low byte */
__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
/* DM breakpoint 2 register extended byte */
__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
/* DM breakpoint 2 register high byte */
__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
/* DM breakpoint 2 register low byte */
__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
/* DM Debug module control register 1 */
__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
/* DM Debug module control register 2 */
__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
/* DM Debug module control/status register 1 */
__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
/* DM Debug module control/status register 2 */
__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
/* DM enable function register */
__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *
 *  Note: The vector numbers listed in ST's manuals for STM8 are offset
 *        by 2 compared to the vector numbers used by EWSTM8.
 *-----------------------------------------------------------------------*/
#define FLASH_EOP_vector                      3 /* IRQ No. in STM8 manual:  1 */
#define FLASH_WR_PG_DIS_vector                3 /* IRQ No. in STM8 manual:  1 */
#define DMA1_CH0_HT_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH0_TC_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH1_HT_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH1_TC_vector                    4 /* IRQ No. in STM8 manual:  2 */
#define DMA1_CH2_HT_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH2_TC_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH3_HT_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define DMA1_CH3_TC_vector                    5 /* IRQ No. in STM8 manual:  3 */
#define RTC_ALARM_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP1_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP2_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_TAMP3_vector                      6 /* IRQ No. in STM8 manual:  4 */
#define RTC_WAKEUP_vector                     6 /* IRQ No. in STM8 manual:  4 */
#define EXTIE_vector                          7 /* IRQ No. in STM8 manual:  5 */
#define EXTIF_vector                          7 /* IRQ No. in STM8 manual:  5 */
#define EXTIPVD_vector                        7 /* IRQ No. in STM8 manual:  5 */
#define EXTIB_vector                          8 /* IRQ No. in STM8 manual:  6 */
#define EXTID_vector                          9 /* IRQ No. in STM8 manual:  7 */
#define EXTI0_vector                         10 /* IRQ No. in STM8 manual:  8 */
#define EXTI1_vector                         11 /* IRQ No. in STM8 manual:  9 */
#define EXTI2_vector                         12 /* IRQ No. in STM8 manual: 10 */
#define EXTI3_vector                         13 /* IRQ No. in STM8 manual: 11 */
#define EXTI4_vector                         14 /* IRQ No. in STM8 manual: 12 */
#define EXTI5_vector                         15 /* IRQ No. in STM8 manual: 13 */
#define EXTI6_vector                         16 /* IRQ No. in STM8 manual: 14 */
#define EXTI7_vector                         17 /* IRQ No. in STM8 manual: 15 */
#define CLK_CSS_vector                       19 /* IRQ No. in STM8 manual: 17 */
#define CLK_SWITCH_vector                    19 /* IRQ No. in STM8 manual: 17 */
#define ADC1_AWD_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define ADC1_EOC_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define ADC1_OVER_vector                     20 /* IRQ No. in STM8 manual: 18 */
#define COMP_EF1_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define COMP_EF2_vector                      20 /* IRQ No. in STM8 manual: 18 */
#define TIM2_BIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_OVR_UIF_vector                  21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_TIF_vector                      21 /* IRQ No. in STM8 manual: 19 */
#define TIM2_CAPCOM_CC1IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define TIM2_CAPCOM_CC2IF_vector             22 /* IRQ No. in STM8 manual: 20 */
#define TIM3_BIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_OVR_UIF_vector                  23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_TIF_vector                      23 /* IRQ No. in STM8 manual: 21 */
#define TIM3_CAPCOM_CC1IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define TIM3_CAPCOM_CC2IF_vector             24 /* IRQ No. in STM8 manual: 22 */
#define RI_vector                            25 /* IRQ No. in STM8 manual: 23 */
#define TIM4_TIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define TIM4_UIF_vector                      27 /* IRQ No. in STM8 manual: 25 */
#define SPI_MODF_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI_OVR_vector                       28 /* IRQ No. in STM8 manual: 26 */
#define SPI_RXNE_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define SPI_TXE_vector                       28 /* IRQ No. in STM8 manual: 26 */
#define SPI_WKUP_vector                      28 /* IRQ No. in STM8 manual: 26 */
#define USART_T_TC_vector                    29 /* IRQ No. in STM8 manual: 27 */
#define USART_T_TXE_vector                   29 /* IRQ No. in STM8 manual: 27 */
#define USART_R_IDLE_vector                  30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_OR_vector                    30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_PE_vector                    30 /* IRQ No. in STM8 manual: 28 */
#define USART_R_RXNE_vector                  30 /* IRQ No. in STM8 manual: 28 */
#define I2C_ADD10_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C_ADDR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_AF_vector                        31 /* IRQ No. in STM8 manual: 29 */
#define I2C_ARLO_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_BERR_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_BTF_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_OVR_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_RXNE_vector                      31 /* IRQ No. in STM8 manual: 29 */
#define I2C_SB_vector                        31 /* IRQ No. in STM8 manual: 29 */
#define I2C_STOPF_vector                     31 /* IRQ No. in STM8 manual: 29 */
#define I2C_TXE_vector                       31 /* IRQ No. in STM8 manual: 29 */
#define I2C_WUFH_vector                      31 /* IRQ No. in STM8 manual: 29 */

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8L151K3_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
